In [1]:
#import libraries
from pymongo import MongoClient
import pandas as pd
from pandas.io.json import json_normalize

In [2]:
def geoquery(lat, long, radius):
    client = MongoClient ('localhost', 27017)
    db = client['companies_clean']

    loc = {"lng": long, "lat": lat}

    result = pd.DataFrame(db.comps.find({
        "coord": {
         "$near": {
           "$geometry": {
              "type": "Point" ,
              "coordinates": [ loc["lng"] , loc["lat"] ]
           },
           "$maxDistance": radius, # In meters 
         }
        }}))
    return result

In [12]:

london = geoquery(51.507410, -0.127685, 5000)
san_francisco = geoquery(37.779248, -122.419243, 5000)
new_york = geoquery(40.725900, -73.981510, 5000)
denver = geoquery(39.739266, -104.987428, 5000)
madrid = geoquery(40.417002, -3.703521, 5000)
new_delhi = geoquery(28.613862, 77.209487, 5000)
locations_list = [london, san_francisco, new_york, denver, madrid, new_delhi]
locations = pd.concat(locations_list).reset_index(drop=True)
locations.to_csv('loscations.csv')

,_id,category_code,coord,founded_year,latitude,longitude,name,number_of_employees,raised_amount,raised_currency_code,total_money_raised
0,5cd5942a666d28a915fcda50,software,"[-0.1262362, 51.5001524]",2008,51.500152,-0.126236,TweetDeck,5.0,300000.0,USD,3800000.0
1,5cd5942a666d28a915fcdc6a,enterprise,"[-0.1262362, 51.5001524]",2008,51.500152,-0.126236,oneDrum,5.0,1000000.0,GBP,1000000.0
2,5cd5942a666d28a915fcd911,finance,"[-0.1418973, 51.5108803]",2007,51.510880,-0.141897,Seedcamp,4.0,3000000.0,EUR,5000000.0
3,5cd5942a666d28a915fcdc6d,advertising,"[-0.1366861, 51.5152023]",2008,51.515202,-0.136686,Struq,50.0,8500000.0,USD,8500000.0
4,5cd5942a666d28a915fcdc0f,advertising,"[-0.1067217, 51.5080607]",2006,51.508061,-0.106722,Specle,9.0,149991.0,GBP,897000.0